app/views/books/_providers_listing.html.erb

SELECT `locations`.* FROM `locations` INNER JOIN `books_users_locations` ON `locations`.`id` = `books_users_locations`.`location_id` INNER JOIN `books_users` ON `books_users_locations`.`books_user_id` = `books_users`.`id` WHERE `books_users`.`book_id` = 5 AND (books_users.is_provided = true)
SELECT `users`.* FROM `users` INNER JOIN `books_users` ON `users`.`id` = `books_users`.`user_id` WHERE `books_users`.`book_id` = 5 AND (books_users.is_provided = true)
---

        <td><%= provider.books_users.find_by_book_id(@book.id).locations.collect(&:name).join(',') %></td>