app/views/books/index.html.erb

             <div class="form-group pull-left">
              <%=select_tag "location_query", options_for_select(Location.all.map { |e| e.name }),:class=>"inputGrab form-control"%>
---
SELECT `locations`.* FROM `locations`

                            <h4><%=book.title%></h4>
                            <p class="text-muted"><%=book.authors.collect(&:name).join(',')%></p>
---
SELECT `authors`.* FROM `authors` INNER JOIN `authors_books` ON `authors`.`id` = `authors_books`.`author_id` WHERE `authors_books`.`book_id` = 1