app/controllers/books_controller.rb

SELECT `books`.* FROM `books` WHERE `books`.`id` IN (28, 13, 6, 8)
---
	def load_book
		@book  = Book.find(params[:id])

SELECT  `books`.* FROM `books` WHERE `books`.`google_id` = '6fIhBQAAQBAJ' LIMIT 1
SELECT  1 AS one FROM `books` WHERE `books`.`google_id` = BINARY '6fIhBQAAQBAJ' LIMIT 1
SELECT  `books`.* FROM `books`  ORDER BY `books`.`id` ASC LIMIT 1
---
	def share
		begin
			@book = Book.find_by_google_id(params[:google_id])
			if @book.present?

SELECT  `books_users`.* FROM `books_users` WHERE `books_users`.`user_id` = 1 AND `books_users`.`book_id` = 1 LIMIT 1
UPDATE `books_users` SET `is_provided` = 0, `updated_at` = '2016-02-12 05:56:07' WHERE `books_users`.`id` = 1
UPDATE `books` SET `books`.`updated_at` = '2016-02-12 05:56:07' WHERE `books`.`id` = 1
---
	def delete_shared
		book_user = current_user.books_users.find_by_book_id(@book.id)
		book_user.is_provided = false
		book_user.locations.destroy_all
		if book_user.save