app/controllers/tokens_controller.rb

	def redeem_token
		@token = Token.find_by_redeem_code(params[:token])
---
SELECT  `tokens`.* FROM `tokens` WHERE `tokens`.`redeem_code` = 'F3TP-W3XE-PAQ7' LIMIT 1