app/controllers/transactions_controller.rb

	def index
		@my_token = current_user.tokens_count
		@my_credit = current_user.profile.credit
		@transactions = (current_user.credit_transactions+current_user.debit_transactions).sort_by(&:created_at).reverse!.paginate :page =>  params[:page], :per_page => 10
---
SELECT  `profiles`.* FROM `profiles` WHERE `profiles`.`user_id` = 1 LIMIT 1