app/controllers/users_controller.rb

def shelf
	@books = current_user.books.paginate :page =>  params[:page], :per_page => 9
---
SELECT  `books`.* FROM `books` INNER JOIN `books_users` ON `books`.`id` = `books_users`.`book_id` WHERE `books_users`.`user_id` = 4 LIMIT 3 OFFSET 0
SELECT COUNT(*) FROM `books` INNER JOIN `books_users` ON `books`.`id` = `books_users`.`book_id` WHERE `books_users`.`user_id` = 3

def show
	@user = User.find(params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1