app/views/layouts/_header.html.erb

             <div class="form-group">
              <%=select_tag "location_query", options_for_select(Location.all.map { |e| e.name }),:class=>"form-control"%>
---
SELECT `locations`.* FROM `locations`